{"vid":"6d7a91b0452c8e3f","title":"Singapore River Trail","description":"Discover Singapore's vibrant past and present on the stunning stroll down the Singapore River","suitable":"Perfect for a morning stroll on a sunny day","suitable_comp":{"time":["morning"],"weather":["sunny"]},"location":{"place":"Clarke Quay","region":"Central Area","coordinates":{"lat":1.2904,"lng":103.8467}},"image_id":"1HpiF5UMbVRBE-p3uoRiS9sfBPbOAw4Bs","more_info":"Singapore River is a picturesque waterway that winds through the heart of the city, offering a glimpse into the nation's rich history and vibrant culture. Along the river's banks, visitors can enjoy world-class dining, shopping, and entertainment, all set against a stunning backdrop of historic architecture and modern skyscrapers.","recommendations":"To make the most of your visit to the Singapore River, be sure to take a river cruise to see the city from a different perspective. As you cruise along the waterway, you'll pass by historic shophouses and landmarks that offer a glimpse into the nation's rich history and vibrant culture. When you're ready for a bite to eat, head to Clarke Quay and try the local cuisine at one of the many restaurants and cafes. If you have the chance, take a stroll along the river at night to enjoy the beautiful city lights. And for a deeper dive into the region's history and culture, be sure to visit the Asian Civilisations Museum."}
{"vid":"8a5b24c821d5f6ab","title":"MacRitchie Treetop Walk","description":"Experience the beauty of Singapore's lush rainforest from a unique vantage point on the MacRitchie Treetop Walk","suitable":"Best for a morning or early afternoon hike","suitable_comp":{"time":["morning"],"weather":["sunny","cloudy"]},"location":{"place":"MacRitchie Reservoir Park","region":"Central Water Catchment","coordinates":{"lat":1.3474,"lng":103.8094}},"image_id":"1cgQV0BM9ssmE9qhUnI6PAaa0ZwLhd9g8","more_info":"The MacRitchie Treetop Walk is a 250-meter-long suspension bridge that takes visitors on a unique journey through the canopy of Singapore's rainforest. Along the way, you'll be able to enjoy stunning views of the forest and its inhabitants, including monkeys, birds, and butterflies.","recommendations":"To make the most of your visit to the MacRitchie Treetop Walk, be sure to wear comfortable shoes and bring plenty of water. The hike to the bridge is approximately 3 kilometers long and can be quite challenging in the heat. If you're lucky, you may spot some of the park's resident monkeys along the way. After your hike, head to the nearby MacRitchie Reservoir for a refreshing swim or picnic. And if you're interested in learning more about the flora and fauna of the region, be sure to visit the HSBC Treetop Walk Interpretive Centre."}
{"vid":"1b3c4e5f6g7h8i9j","title":"Southern Ridges Walk","description":"Take in the panoramic views of Singapore's southern coastline on the Southern Ridges Walk","suitable":"Perfect for an evening walk","suitable_comp":{"time":["evening"],"weather":["sunny","cloudy"]},"location":{"place":"Mount Faber Park","region":"Southern Islands","coordinates":{"lat":1.2731,"lng":103.8145}},"image_id":"1QRgEi9fGTi-ww8oBqeQHpupj2b5ULfb0","more_info":"The Southern Ridges Walk is a 10-kilometer trail that takes visitors through some of the most scenic and historic areas of Singapore's southern coastline. Along the way, you'll be able to enjoy panoramic views of the city skyline, as well as the lush greenery of the surrounding hills and forests.","recommendations":"To make the most of your visit to the Southern Ridges Walk, be sure to wear comfortable shoes and bring a jacket or sweater, as it can get quite cool in the evenings. Start your walk at Mount Faber Park and follow the signs to the Henderson Waves, a unique wave-like pedestrian bridge that offers stunning views of the city. From there, continue on to the Forest Walk and take in the lush greenery of the surrounding hills. And if you're feeling adventurous, head to the nearby Sentosa Island for some fun-filled activities and attractions."}
{"vid":"2b7c6a8d0e9f1g3h","title":"Gardens by the Bay","description":"Explore Singapore's futuristic gardens and immerse yourself in a world of sustainable beauty.","suitable":"Best for an afternoon visit","suitable_comp":{"time":["afternoon"],"weather":["sunny","cloudy","rainy"]},"location":{"place":"Marina Bay","region":"Central Area","coordinates":{"lat":1.2814,"lng":103.8631}},"image_id":"1OPjOHnCNvJf5zkPxocYhkIiMVX5h9En1","more_info":"Gardens by the Bay is a breathtakingly beautiful nature park in the heart of Singapore. The park features a wide range of attractions, including the iconic Supertrees, two conservatories, and a vast array of flora and fauna from around the world.","recommendations":"To make the most of your visit to Gardens by the Bay, start with a stroll around the outdoor gardens and enjoy the panoramic views of the Marina Bay skyline. Next, head to the Cloud Forest and Flower Dome conservatories to immerse yourself in a world of lush greenery and colorful blooms. Don't miss the Supertree Grove, where you can catch the Garden Rhapsody light and sound show in the evening. And if you're feeling hungry, head to the nearby Satay by the Bay food court for some delicious local cuisine."}
{"vid":"5e8d2c7a1b9f0g3h","title":"Bukit Timah Nature Reserve","description":"Get back to nature and explore Singapore's largest nature reserve.","suitable":"Best for a morning hike","suitable_comp":{"time":["morning"],"weather":["cloudy"]},"location":{"place":"Bukit Timah","region":"Central Catchment Nature Reserve","coordinates":{"lat":1.3547,"lng":103.7764}},"image_id":"1roH7lmZCxhRTF8U7zZNNmHiGgvm4KAmu","more_info":"Bukit Timah Nature Reserve is home to some of Singapore's last remaining patches of primary rainforest. The reserve offers a range of trails for hikers and nature lovers, as well as opportunities to spot native wildlife like monkeys, birds, and butterflies.","recommendations":"To make the most of your visit to Bukit Timah Nature Reserve, start early in the morning to avoid the heat and crowds. The reserve offers several trails of varying lengths and difficulties, so be sure to choose one that suits your fitness level. Along the way, keep your eyes peeled for some of the park's resident wildlife, including long-tailed macaques and flying lemurs. And don't forget to stop at the summit of Bukit Timah Hill for panoramic views of the surrounding rainforest."}
{"vid":"3f1a5b6c8d7e9h0g","title":"Chinatown Food Tour","description":"Experience the delicious flavors of Singapore's vibrant Chinatown on a food tour.","suitable":"Perfect for an evening tour","suitable_comp":{"time":["evening"],"weather":["sunny","cloudy"]},"location":{"place":"Chinatown","region":"Central Area","coordinates":{"lat":1.2834,"lng":103.8448}},"image_id":"1sRdRDBt0vE_44v9kFvRHFcgyWaXUUUNy","more_info":"Chinatown is a bustling district in the heart of Singapore that's home to a wide range of Chinese culture, traditions, and cuisine. A food tour is the perfect way to explore the neighborhood and sample some of the delicious local delicacies.","recommendations":"To make the most of your food tour in Chinatown, be sure to come hungry and wear comfortable shoes. Your tour guide will take you to some of the best food stalls and restaurants in the neighborhood, where you can try a wide range of dishes like bak kut teh, char kway teow, and dim sum. Don't forget to stop by the night market on Smith Street for some souvenirs and street food treats."}
{"vid":"7h2j9k4l3m8n1o6p","title":"Haw Par Villa","description":"Explore the surreal and often bizarre world of Haw Par Villa.","suitable":"Best for a morning or afternoon visit","suitable_comp":{"time":["morning","afternoon"],"weather":["sunny"]},"location":{"place":"Pasir Panjang","region":"West Region","coordinates":{"lat":1.2842,"lng":103.7816}},"image_id":"1sa9BReoHgQL529dOPnMynKTVYV2Ly9st","more_info":"Haw Par Villa is a theme park unlike any other, featuring a collection of over 1,000 colorful and often surreal statues and dioramas that depict scenes from Chinese mythology, folklore, and history.","recommendations":"To make the most of your visit to Haw Par Villa, take your time to explore the park and soak in the bizarre and often unsettling atmosphere. Don't miss the Ten Courts of Hell exhibit, which depicts the gruesome punishments that await sinners in the afterlife. And if you're feeling brave, take a walk through the Dragon and Tiger Pagodas, where you'll encounter even more strange and surreal sights."}
{"vid":"4o3t2r1e5x8z9y6u","title":"Pulau Ubin","description":"Escape the hustle and bustle of Singapore and explore the rustic charm of Pulau Ubin.","suitable":"Best for a morning or afternoon visit","suitable_comp":{"time":["morning","afternoon"],"weather":["cloudy"]},"location":{"place":"Pulau Ubin","region":"North-East Region","coordinates":{"lat":1.4167,"lng":103.9675}},"image_id":"1NVuZjNcRWFvpc6nkkQx0LIXqCDtWl33X","more_info":"Pulau Ubin is a small island located off the coast of mainland Singapore that's known for its rustic charm and laid-back atmosphere. The island is home to a variety of wildlife, including monkeys, wild boars, and exotic birds.","recommendations":"To make the most of your visit to Pulau Ubin, rent a bicycle and explore the island's many trails and scenic spots. Don't miss the Chek Jawa Wetlands, a unique ecosystem that's home to a variety of marine life and bird species. You can also visit the island's many temples and shrines, which offer a glimpse into the local culture and traditions. And if you're feeling hungry, be sure to try the island's famous seafood dishes, which are served up fresh and delicious at the local restaurants and food stalls."}
{"vid":"2k5s7d1j0f8h6a4p","title":"Sentosa Island","description":"Experience fun, sun, and adventure at Singapore's premier island resort destination.","suitable":"Perfect for a full-day visit","suitable_comp":{"time":["morning","afternoon","evening"],"weather":["sunny","cloudy","rainy"]},"location":{"place":"Sentosa Island","region":"Southern Islands","coordinates":{"lat":1.2494,"lng":103.8303}},"image_id":"142NNKQDGpbOAv9lyWcIkuWbYN4Zi6tKk","more_info":"Sentosa Island is Singapore's premier island resort destination, offering a wide range of attractions and activities for visitors of all ages. From theme parks and beaches to museums and shopping, there's something for everyone on this tropical paradise.","recommendations":"To make the most of your visit to Sentosa Island, plan to spend the entire day exploring the island's many attractions. Start with a visit to Universal Studios Singapore, where you can experience thrilling rides and shows based on your favorite movies and TV shows. Next, head to the S.E.A. Aquarium to see some of the world's most exotic marine life up close. Don't miss the Merlion statue, a Singapore icon that offers stunning views of the city skyline. And if you're looking for some fun in the sun, head to one of the island's many beaches, like Palawan or Siloso Beach. Finish your day with a visit to the Sentosa Boardwalk, where you can enjoy a beautiful sunset over the water and a delicious meal at one of the many waterfront restaurants."}
{"vid":"9l2m4n1o6p3q8r5s","title":"East Coast Park Beach","description":"Spend a day in the sun and sand at Singapore's most popular beach destination.","suitable":"Perfect for a full-day visit","suitable_comp":{"time":["morning","afternoon","evening"],"weather":["sunny","cloudy"]},"location":{"place":"East Coast Park","region":"East Region","coordinates":{"lat":1.3012,"lng":103.9083}},"image_id":"1SXI6Bpt4uq18VNA8nBoXxbsspa3wvXlF","more_info":"East Coast Park is Singapore's most popular beach destination, offering a wide range of recreational activities and facilities for visitors of all ages. The park features a long stretch of sandy beach, as well as picnic areas, barbecue pits, and bicycle rentals.","recommendations":"To make the most of your visit to East Coast Park, start with a walk or jog along the park's scenic coastline, taking in the views of the water and the city skyline. Next, rent a bicycle and explore the park's many trails and facilities, which include a skate park, a playground, and a water sports center. Don't miss the park's many food stalls and restaurants, which offer a range of delicious local and international cuisine. And if you're looking for a fun and relaxing way to end your day, head to one of the park's many barbecue pits and grill up some fresh seafood and meat while watching the sun set over the water."}
